<test_category>
Адміністрування
<test>
<test_name>
Створення та адміністрування сайту
<q_start>
<single_answer_q>
<question>
            Документ або інформаційний ресурс, доступ до якого здійснюється за допомогою браузера.  
<aswers>
Веб-сторінка
Гіпертекст
Хостинг
Контент
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
            Як називається об’єднання тематично пов’язаних веб-сторінок і документів під одним доменним іменем?
<aswers>
Сайт
Гіпертекст
Хостинг
Контент
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
            У HTML-коді веб-сторінки в кутових дужках < > записують:
<aswers>
мітки
теги
параметри
позначки
<r_aswer>
2
<q_start>
<multy_answer_q>
<question>
              Які програмні засоби дозволяють підготувати HTML-документ? (декілька правильних)
<aswers>
Графічний редактор 
Текстовий процесор 
Текстовий редактор 
Редактори HTML
<r_aswers>
4
2
<q_start>
<single_answer_q>
<question>
            Що таке HTML?
<aswers>
Додаткова інформація, що записується біля відкриваючого тегу
Команда, яка записується в кутових дужках < > для виконання браузером
Мова гіпертекстової розмітки документів для мережі Інтернет
<r_aswer>
3
<q_start>
<single_answer_q>
<question>
           Як називають сукупність веб-сторінок, пов’язаних спільною темою і доступних під одним доменним іменем?
<aswers>
Сайт 
HTML-документ 
Таблиця 
Документ 
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
           Як називають схему зв’язків між розділами і окремими сторінками сайта?
<aswers>
HTML-розмітка 
Таблиця 
Bеб-сторінка 
Структура сайта 
<r_aswer>
4
<q_start>
<single_answer_q>
<question>
           Яке твердження є правильним?
<aswers>
Для розробки сайта обов’язково знати HTML і ще декілька технологій 
Малюнки і текст для сайта обов’язково готують різні люди 
Сайт може розроблятися колективом розробників 
Сайт не може розробити одна людина 
<r_aswer>
1
<q_start>
<multy_answer_q>
<question>
             Фахівці з якої справи можуть знадобитися під час розробки сайта?
<aswers>
Написання і набір тексту 
Підготовка графічного матеріалу 
Проектування структури сайта 
Верстання сторінок сайта 
<r_aswers>
1
2
3
4
<test>
<test_name>
Навчання в Інтернеті. Професії майбутнього.
<q_start>
<single_answer_q>
<question>
            За допомогою Інтернету не можна 
<aswers>
поновлювати антивірусні бази
проходити тестування для визначення рівня знань з предметів
дистанційно опановувати нові знання,
не має правильної відповіді
<r_aswer>
4
<q_start>
<multy_answer_q>
<question>
            Використовуючи Інтернет для навчання можна здійснювати
<aswers>
пошук навчальних матеріалів (текстів, зображень, віде, ел.-підручників, та ін.)
завантаження потрібних програм
отримувати консультації на форумах
жодна відповідь не є правильною
<r_aswers>
1
2
3
<q_start>
<multy_answer_q>
<question>
            Розвиток інформаційних технологій впливає на ринок праці, а саме відбувається
<aswers>
глобалізація
конкуренція між виробниками
широко застосовуються роботи
зменшується використання програмових пристроїв
спрощуються системи управління
зростають вимоги до екологічності товарів
<r_aswers>
1
2
3
4
<q_start>
<multy_answer_q>
<question>
            Цілий ряд професій у недалекому майбутньому
<aswers>
зникне
з'являться 
будуть отримувати навіть люди без особливого навчання
не має правильної відповіді
<r_aswers>
1
2
3
<q_start>
<multy_answer_q>
<question>
            Відмітьте ті навички та вміння, котрі будуть потрібні людям з ІТ-сектору
<aswers>
Системне мислення
Клієнтоорієнтованість
Управління проектами
Навички міжгалузевої комунікації
Робота з людьми
Багатомовність і мультикультурність
Робота в умовах невизначеності
<r_aswers>
1
2
3
4
5
6
<q_start>
<single_answer_q>
<question>
            Розробляє та створює «дружні», адаптовані під людину та безпечні для неї 
            інтерфейси обладнання, техніку, софт різного рівня. Володіє хорошими компетенціями 
             в «юзабіліті» (створення інтерфейсів, максимально комфортних для користувача).
<aswers>
Архітектор інформаційних систем
Дизайнер інтерфейсів
Проектувальник нейроінтерфейсів
Розробник моделей Big Data
<r_aswer>
2
<q_start>
<single_answer_q>
<question>
            Виконує широке коло робіт з системами обробки даних. Зокрема, він проектує бази даних, 
            розробляє алгоритми дії, забезпечує звернення користувачів до сховищ даних, контролює
            якість і логіку зберігання та витягу інформації. 
<aswers>
Архітектор інформаційних систем
Дизайнер інтерфейсів
Проектувальник нейроінтерфейсів
Розробник моделей Big Data
<r_aswer>
4
<q_start>
<single_answer_q>
<question>
            Проектує систему збору та обробки великих масивів даних, що отримуються через інтернет, 
            розробляє інтерфейси збирання та безпосередньо аналітичні моделі. В Україні вже 
            відкриваються вакансії за цією спеціальністю, хоча поки що попит на них незначний. 
<aswers>
Архітектор інформаційних систем
Дизайнер інтерфейсів
Проектувальник нейроінтерфейсів
Розробник моделей Big Data
<r_aswer>
3
<q_start>
<single_answer_q>
<question>
            Формує нормативну-правову взаємодію в мережі (в тому числі у віртуальних світах),
            розробляє систему правового захисту людини та власності в інтернеті (включаючи віртуальну власність).
<aswers>
Архітектор інформаційних систем
Дизайнер інтерфейсів
Проектувальник нейроінтерфейсів
Кіберслідчий
Мережевий юрист
немає правильного варіанту
<r_aswer>
5
