<test_category>
Програмування
<test>
<test_name>
Базовий словник програміста 
<q_start>
<single_answer_q>
<question>
            Рекурсія - це:? 
<aswers>
          Функція, яка викликає сама себе.
          Функція, яка повертає результат розрахунку.
          Фператор, що заміняє вкладені цикли.
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
            Рефакторинг - це:? 
<aswers>
         Послідовність даних та інструкцій, призначена для обчислювального пристрою.
         Самостійний елемент коду програми, який дозволяє задіяти окремі підпрограми.
         Процес внесення змін до програмного коду відповідно до деякого набору правил.
<r_aswer>
3
<q_start>
<single_answer_q>
<question>
            Фреймворк - це:? 
<aswers>
         Інструкція, що описує порядок дій для доступу до даних.
         Допоміжне програмне забезпечення, призначене для виконання специфічних задач.
         Вид програмного забезпечення, що є основою (каркасом) різноманітних прикладних програмних продуктів.
<r_aswer>
3
<q_start>
<single_answer_q>
<question>
            Валідність - це:? 
<aswers>
         Набір інструкцій, які описують порядок дій для отримання результату розрахунку.
         Відповідність коду сайту прийнятим в мережі стандартам та правилам під назвою W3C.
         Розробка чого-небудь: програм, ігор тощо.
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
            Інкапсуляція - це:? 
<aswers>
         Механізм, який об’єднує дані та код, маніпулюючи цими даними, а також захищає від зовнішнього впливу або неправильного використання.
         Журнал, в якому записуються в хронологічному порядку всі виконані дії. Наприклад: час виникнення помилок, збоїв, дій користувачів тощо.
         Метод виклику змінних, який використовується для великих проектів.
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
            Поліморфізм - це:? 
<aswers>
         Аналіз програмного коду, який направлено на пошук помилок.
         Властивість, яка дозволяє одне і те саме ім’я використовувати для рішення двох або більше схожих, але технічно різних задач.
         Процес обробки коду компілятором.
<r_aswer>
2
<q_start>
<single_answer_q>
<question>
            Компіляція - це:? 
<aswers>
         Процес переведення вихідного коду програми, який написано на мові більш високого рівня в код на мові більш низького рівня .
         Зберегти/зафіксувати зміни коду в репозиторії (сховище) коду.
         Присвоєння обраній змінній нового значення.
<r_aswer>
1
<q_start>
<single_answer_q>
<question>
            Інтерпретація - це:? 
<aswers>
         Програмне забезпечення, призначене для виконання допоміжних робіт.
         Підсвітка неправильно написаного коду в багатоплатформній середі розробки.
         Покомандне виконання вихідного коду програми інтерпретатором без попередньої компіляції.
<r_aswer>
3
<q_start>
<single_answer_q>
<question>
            Пагінація - це::? 
<aswers>
         Процес, за допомогою якого один об'єкт може набувати властивості іншого.
         Нумерація сторінок або розбиття цільного блоку інформації на сторінки.
         Об'єднані однорідні елементи в самостійні одиниці, що мають певні властивості.
<r_aswer>
2
<q_start>
<single_answer_q>
<question>
            Пагінація - це::? 
<aswers>
         Процес, за допомогою якого один об'єкт може набувати властивості іншого.
         Нумерація сторінок або розбиття цільного блоку інформації на сторінки.
         Об'єднані однорідні елементи в самостійні одиниці, що мають певні властивості.
<r_aswer>
2
<test>
<test_name>
Програмування в C++. Типи даних. 
<q_start>
<multy_answer_q>
<question>
                        Що включає в себе алфавіт мови програмування C ++ :
<aswers>
          великі та малі латинські букви, знак підкреслення;
          арабські цифри від 0 до 9;
          спецсимволи: знаки математичних дій, операторів, службові символи тощо;
          великі та малі українські букви, знак підкреслення;
<r_aswers>
1
2
3
<q_start>
<single_answer_q>
<question>
                        Чи розрізняє регістр літер синтаксис мови С++ ?
<aswers>
          Так
          Ні
<r_aswer>
1
<q_start>
<multy_answer_q>
<question>
                        Як називаються величини, які не змінюють свого значення протягом виконання програми?
<aswers>
          Сталі
          Змінні
          Коментарі
          Динамічні
          Статичні
<r_aswers>
1
2
<q_start>
<single_answer_q>
<question>
                        Що таке "ідентифікатор"?
<aswers>
          Назва файлу програми
          Текстовий опису оператора
          Текст коментаря
          Ім"я правильно названого об'єкта в програмі (змінної, типу )
<r_aswer>
4
<q_start>
<multy_answer_q>
<question>
                        Які з нижче наведених текстових рядків можуть бути ідентифікаторами?
<aswers>
          Sum1
          1st_name
          моя_змінна
          my_constanta
          main_function
<r_aswers>
1
3
4
5
<q_start>
<multy_answer_q>
<question>
                        Відмітьте цілочисельні типи даних.
<aswers>
          float
          char
          long
          double
          int
<r_aswers>
2
3
5
<q_start>
<multy_answer_q>
<question>
                       Відмітьте дійсні типи змінних.
<aswers>
          long
          float
          char
          int
          double
<r_aswers>
2
5
<q_start>
<single_answer_q>
<question>
                       Надання змінній чи константі деякого значення одразу при оголошенні називається:
<aswers>
          Присвоюванням
          Ініціалізацією
          Кастомізацією
          Інтерполюванням
<r_aswer>
2
<q_start>
<single_answer_q>
<question>
                      Яке значення буде записане в змінній x після виконання таких команд:
                      x = 12;
                      x = x/2;
<aswers>
          0
          24
          12
          6
<r_aswer>
4
<q_start>
<single_answer_q>
<question>
                      Чи ініціалізуються в С++ змінні/константи за замовчуванням?
<aswers>
          Так
          Ні
<r_aswer>
2
<q_start>
<single_answer_q>
<question>
                     Якого типу буде результат обчислення виразу
                     2 + (2.0 * 2) - 10
<aswers>
          цілого
          символьного
          рядкового
          дійсного
          вказівник
<r_aswer>
4
